Джира/src/Documents/Центр_Задача/Центр_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Центр_Задача</name>
  <comment>Задачи сотрудников</comment>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.Центр_ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Центр_Партнеры</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Центр_Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.Центр_МеткиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Джира/src/InformationRegisters/Центр_ДедлайнЗадач/Центр_ДедлайнЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_ДедлайнЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Согласовант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Дедлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПереноса</name>
    <type>
      <types>CatalogRef.Центр_ПричинаПереносаДедлайна</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/Documents/Центр_Задача/Forms/ФормаОтветаСогласованияДедлайна/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Задача) Тогда
		Задача = Параметры.Задача;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Центр_ДедлайнЗадачСрезПоследних.Период,
	|	Центр_ДедлайнЗадачСрезПоследних.Согласовант,
	|	Центр_ДедлайнЗадачСрезПоследних.Дедлайн,
	|	Центр_ДедлайнЗадачСрезПоследних.КомментарийОценки
	|ИЗ
	|	РегистрСведений.Центр_ДедлайнЗадач.СрезПоследних(, Задача = &Задача) КАК Центр_ДедлайнЗадачСрезПоследних
	|ГДЕ
	|	НЕ Центр_ДедлайнЗадачСрезПоследних.Отказ
	|	И НЕ Центр_ДедлайнЗадачСрезПоследних.Согласовано
	|	И Центр_ДедлайнЗадачСрезПоследних.Согласующий = &Согласующий";

	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("Согласующий", Пользователи.АвторизованныйПользователь());
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Период = Выборка.Период;
		КомментарииСогласования = Выборка.КомментарийОценки;	
		Дедлайн = Выборка.Дедлайн;
		Согласовант = Выборка.Согласовант;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Согласовано(Команда)
	СогласованоНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отказ(Команда)
	ОповещениеООтмене = Новый ОписаниеОповещения("ОбработкаВопросаОтказ", ЭтотОбъект);
	ПоказатьВводСтроки(ОповещениеООтмене, "", "Введите причину отказа", , Истина);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СогласованоНаСервере()
	РегистрыСведений.Центр_ДедлайнЗадач.ИзменитьПоследнююЗаписьПоЗадаче(Задача, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОтказ(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ОтказНаСервере(Результат);
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтказНаСервере(Результат)
	РегистрыСведений.Центр_ДедлайнЗадач.ИзменитьПоследнююЗаписьПоЗадаче(Задача, Истина, Ложь, Результат);
КонецПроцедуры
#КонецОбласти
